GitGriever/Game/Keil_v5/ARM/Boards/Atmel/SAM3U-EK/RL/USB/Device/HID/GLCD_16bitIF_SAM3U.c
/*******************************************************************************
* Write a value to the to LCD register                                         *
*   Parameter:    reg:    register to be written                               *
*                 val:    value to write to the register                       *
*******************************************************************************/

static __inline void wr_reg (unsigned char reg, unsigned short val) {

  wr_cmd(reg);
  wr_dat(val);
}

#if 0
/*******************************************************************************
* Read from the LCD register                                                   *
*   Parameter:    reg:    register to be read                                  *
*   Return:               value read from the register                         *
*******************************************************************************/

static unsigned short rd_reg (unsigned char reg) {

  wr_cmd(reg);
  return(rd_dat());
}
#endif

/************************ Exported functions **********************************/

/*******************************************************************************
* Initialize the Graphic LCD controller                                        *
*   Parameter:                                                                 *
*   Return:                                                                    *
*******************************************************************************/

#define LCD_D0_D14      (0xFE01FE00)
#define LCD_D15         (PIO_PB6)
#define LCD_RS          (PIO_PB8)
#define LCD_RD          (PIO_PB19)
#define LCD_WR          (PIO_PB23)
#define LCD_NCS2        (PIO_PC16)
#define LCD_BACKLIGHT   (PIO_PC19)

void GLCD_Init (void) {
  unsigned int mode, i;

/* Configure the LCD Control pins --------------------------------------------*/
  PMC->PMC_WPMR = 0x504D4300;                   /* Disable write protect      */
  PMC->PMC_PCER0  = ((1 << ID_PIOB) |           /* Enable clock for PIOB      */
                     (1 << ID_PIOC) );          /* Enable clock for PIOC      */
  PMC->PMC_WPMR = 0x504D4301;                   /* Enable write protect       */

/* Configure the Data Bus pins -----------------------------------------------*/
  PIOB->PIO_PDR   =  (LCD_D0_D14 | LCD_D15);    /* Enable Peripheral function */
  PIOB->PIO_IDR   =  (LCD_D0_D14 | LCD_D15);    /* Disable interrupt          */
  PIOB->PIO_ABSR &= ~(LCD_D0_D14);              /* Select Peripheral A        */
  PIOB->PIO_ABSR |=  (LCD_D15);                 /* Select Peripheral B        */

/* Configure the Control pins ------------------------------------------------*/
  PIOB->PIO_PDR   =  (LCD_RS);                  /* Enable Peripheral function */
  PIOB->PIO_IDR   =  (LCD_RS);                  /* Disable interrupt          */
  PIOB->PIO_ABSR |=  (LCD_RS);                  /* Select Peripheral B        */

  PIOB->PIO_PDR   =  (LCD_RD | LCD_WR);         /* Enable Peripheral function */
  PIOB->PIO_IDR   =  (LCD_RD | LCD_WR);         /* Disable interrupt          */
  PIOB->PIO_ABSR &= ~(LCD_RD | LCD_WR);         /* Select Peripheral A        */

  PIOC->PIO_PDR   =  (LCD_NCS2);                /* Enable Peripheral function */
  PIOC->PIO_IDR   =  (LCD_NCS2);                /* Disable interrupt          */
  PIOC->PIO_ABSR &= ~(LCD_NCS2);                /* Select Peripheral A        */

/* Configure the Backlight pins ----------------------------------------------*/
  PIOC->PIO_IDR   =                             /* Disable interrupt          */
  PIOC->PIO_OER   =                             /* Enable output              */
  PIOC->PIO_PER   = (LCD_BACKLIGHT);            /* Disable Peripheral function*/
  PIOC->PIO_CODR  = (LCD_BACKLIGHT);            /* Backlight off              */

/*-- SMC Configuration -------------------------------------------------------*/
/*--------------------------- CS2 --------------------------------------------*/
  PMC->PMC_WPMR = 0x504D4300;                   /* Disable write protect      */
  PMC->PMC_PCER0  = (1 << ID_SMC);              /* Enable clock for SMC       */
  PMC->PMC_WPMR = 0x504D4301;                   /* Enable write protect       */

  SMC->SMC_CS_NUMBER[2].SMC_SETUP = 0
                                 | (SMC_SETUP_NWE_SETUP(4)   )
                                 | (SMC_SETUP_NCS_WR_SETUP(2))
                                 | (SMC_SETUP_NRD_SETUP(4)   )
                                 | (SMC_SETUP_NCS_RD_SETUP(2))
                                 ;

  SMC->SMC_CS_NUMBER[2].SMC_PULSE = 0
                                 | (SMC_PULSE_NWE_PULSE(5)    )
                                 | (SMC_PULSE_NCS_WR_PULSE(18))
                                 | (SMC_PULSE_NRD_PULSE(5)    )
                                 | (SMC_PULSE_NCS_RD_PULSE(18))
                                 ;

  SMC->SMC_CS_NUMBER[2].SMC_CYCLE = 0
                                 | (SMC_CYCLE_NWE_CYCLE(22))
                                 | (SMC_CYCLE_NRD_CYCLE(22))
                                 ;

  mode = SMC->SMC_CS_NUMBER[2].SMC_MODE;
  SMC->SMC_CS_NUMBER[2].SMC_MODE  = (mode & ~(SMC_MODE_DBW | SMC_MODE_READ_MODE | SMC_MODE_WRITE_MODE))
                                 | (SMC_MODE_READ_MODE)
                                 | (SMC_MODE_WRITE_MODE)
                                 | (SMC_MODE_DBW)
                                 ;

  delay(5);                             /* Delay 50 ms                        */

  /* Start internal OSC                                                       */
  wr_reg(0x19, 0x49);                   /* OSCADJ=10 0000, OSD_EN=1 // 60Hz   */
  wr_reg(0x93, 0x0C);                   /* RADJ=1100                          */

  /* Power on flow                                                            */
  wr_reg(0x44, 0x4D);                   /* VCM=100 1101                       */
  wr_reg(0x45, 0x11);                   /* VDV=1 0001                         */
  wr_reg(0x20, 0x40);                   /* BT=0100                            */
  wr_reg(0x1D, 0x07);                   /* VC1=111                            */
  wr_reg(0x1E, 0x00);                   /* VC3=000                            */
  wr_reg(0x1F, 0x04);                   /* VRH=0100                           */

  wr_reg(0x1C, 0x04);                   /* AP=100                             */
  wr_reg(0x1B, 0x10);                   /* GASENB=0, PON=1, DK=0, XDK=0, DDVDH_TRI=0, STB=0 */
  delay(5);

  wr_reg(0x43, 0x80);                   /* Set VCOMG=1                        */
  delay(5);

