GitGriever/Game/Keil_v5/ARM/Boards/Atmel/SAM3U-EK/RL/USB/Device/HID/GLCD_16bitIF_SAM3U.c
  /* Gamma for CMO 2.8                                                        */
  wr_reg(0x46, 0x95);
  wr_reg(0x47, 0x51);
  wr_reg(0x48, 0x00);
  wr_reg(0x49, 0x36);
  wr_reg(0x4A, 0x11);
  wr_reg(0x4B, 0x66);
  wr_reg(0x4C, 0x14);
  wr_reg(0x4D, 0x77);
  wr_reg(0x4E, 0x13);
  wr_reg(0x4F, 0x4C);
  wr_reg(0x50, 0x46);
  wr_reg(0x51, 0x46);

  /* Display Setting                                                          */
  wr_reg(0x01, 0x06);                   /* IDMON=0, INVON=1, NORON=1, PTLON=0 */
#if (LANDSCAPE == 1)
  wr_reg(0x16, 0x68);                   /* MY=0, MX=1, MV=1, BGR=1            */
#else
  wr_reg(0x16, 0xC8);                   /* MY=1, MX=1, MV=0, BGR=1            */
#endif
  wr_reg(0x23, 0x95);                   /* N_DC=1001 0101                     */
  wr_reg(0x24, 0x95);                   /* P_DC=1001 0101                     */
  wr_reg(0x25, 0xFF);                   /* I_DC=1111 1111                     */
  wr_reg(0x27, 0x06);                   /* N_BP=0000 0110                     */
  wr_reg(0x28, 0x06);                   /* N_FP=0000 0110                     */
  wr_reg(0x29, 0x06);                   /* P_BP=0000 0110                     */
  wr_reg(0x2A, 0x06);                   /* P_FP=0000 0110                     */
  wr_reg(0x2C, 0x06);                   /* I_BP=0000 0110                     */
  wr_reg(0x2D, 0x06);                   /* I_FP=0000 0110                     */
  wr_reg(0x3A, 0x01);                   /* N_RTN=0000, N_NW=001               */
  wr_reg(0x3B, 0x01);                   /* P_RTN=0000, P_NW=001               */
  wr_reg(0x3C, 0xF0);                   /* I_RTN=1111, I_NW=000               */
  wr_reg(0x3D, 0x00);                   /* DIV=00                             */
  wr_reg(0x3E, 0x38);                   /* SON=38h                            */
  wr_reg(0x40, 0x0F);                   /* GDON=0Fh                           */
  wr_reg(0x41, 0xF0);                   /* GDOF=F0h                           */

  /* Display ON Setting                                                       */
  wr_reg(0x90, 0x7F);                   /* SAP=0111 1111                      */
  wr_reg(0x26, 0x04);                   /* GON=0, DTE=0, D=01                 */
  delay(10);
  wr_reg(0x26, 0x24);                   /* GON=1, DTE=0, D=01                 */
  wr_reg(0x26, 0x2C);                   /* GON=1, DTE=0, D=11                 */
  delay(10);
  wr_reg(0x26, 0x3C);                   /* GON=1, DTE=1, D=11                 */

 #if (LANDSCAPE == 1)
  #if (ROTATE180 == 0)
   wr_reg (0x16, 0xA8);
  #else
   wr_reg (0x16, 0x68);
  #endif
 #else
  #if (ROTATE180 == 0)
   wr_reg (0x16, 0x08);
  #else
   wr_reg (0x16, 0xC8);
  #endif
 #endif

  /* Display scrolling settings ----------------------------------------------*/
  wr_reg(0x0E, 0x00);                   /* TFA MSB                            */
  wr_reg(0x0F, 0x00);                   /* TFA LSB                            */
  wr_reg(0x10, 320 >> 8);               /* VSA MSB                            */
  wr_reg(0x11, 320 &  0xFF);            /* VSA LSB                            */
  wr_reg(0x12, 0x00);                   /* BFA MSB                            */
  wr_reg(0x13, 0x00);                   /* BFA LSB                            */

  /* Turn backlight on with a certain backlight level                         */
  for (i = 0; i < 25 /* level */; i++) {
    PIOC->PIO_SODR = (LCD_BACKLIGHT);
    PIOC->PIO_SODR = (LCD_BACKLIGHT);
    PIOC->PIO_SODR = (LCD_BACKLIGHT);

    PIOC->PIO_CODR = (LCD_BACKLIGHT);
    PIOC->PIO_CODR = (LCD_BACKLIGHT);
    PIOC->PIO_CODR = (LCD_BACKLIGHT);
  }
  PIOC->PIO_SODR = (LCD_BACKLIGHT);
}


/*******************************************************************************
* Set draw window region                                                       *
*   Parameter:      x:        horizontal position                              *
*                   y:        vertical position                                *
*                   w:        window width in pixel                            *
*                   h:        window height in pixels                          *
*   Return:                                                                    *
*******************************************************************************/

void GLCD_SetWindow (unsigned int x, unsigned int y, unsigned int w, unsigned int h) {
  unsigned int xe, ye;

  xe = x+w-1;
  ye = y+h-1;

  wr_reg(0x02, x  >>    8);             /* Column address start MSB           */
  wr_reg(0x03, x  &  0xFF);             /* Column address start LSB           */
  wr_reg(0x04, xe >>    8);             /* Column address end MSB             */
  wr_reg(0x05, xe &  0xFF);             /* Column address end LSB             */
  
  wr_reg(0x06, y  >>    8);             /* Row address start MSB              */
  wr_reg(0x07, y  &  0xFF);             /* Row address start LSB              */
  wr_reg(0x08, ye >>    8);             /* Row address end MSB                */
  wr_reg(0x09, ye &  0xFF);             /* Row address end LSB                */
}


/*******************************************************************************
* Set draw window region to whole screen                                       *
*   Parameter:                                                                 *
*   Return:                                                                    *
*******************************************************************************/

void GLCD_WindowMax (void) {
  GLCD_SetWindow (0, 0, WIDTH, HEIGHT);
}


/*******************************************************************************
* Draw a pixel in foreground color                                             *
*   Parameter:      x:        horizontal position                              *
*                   y:        vertical position                                *
*   Return:                                                                    *
*******************************************************************************/

void GLCD_PutPixel (unsigned int x, unsigned int y) {

  wr_reg(0x02, x >>    8);              /* Column address start MSB           */
  wr_reg(0x03, x &  0xFF);              /* Column address start LSB           */
  wr_reg(0x04, x >>    8);              /* Column address end MSB             */
  wr_reg(0x05, x &  0xFF);              /* Column address end LSB             */
  
